// MARK: Menu Bar
/* Run on login */
"runOnLogin" = "Open at Login...";

/* Quit Option */
"quit" = "Quit Zeitgeist";

/* Menu title */
"zeitgesitMenuTitle" = "Zeitgeist Options";

/* Title that appears when hovering over the menu bar icon */
"menubarTitle" = "Zeitgeist \nLatest build: %@";

// MARK: Login Screen
/* Link to Zeit's account tokens page */
"createTokenButton" = "Create Token";

/* Login button */
"loginButton" = "Log In";

/* Label for text input that accepts the account access token */
"tokenInputLabel" = "Enter Vercel access token:";

"tokenInputPlaceholder" = "Access Token";

// MARK: Error State
/* Title for token issues */
"tokenErrorHeading" = "Something went wrong";

/* Helper text when we suspect an incorrect token */
"accessHint" = "Are you sure you entered your Vercel access token correctly?";

/* Button text to go back to login screen */
"backButton" = "Go Back";

/* Empty state for deployments */
"emptyState" = "No Deployments Found";

/* Button text that will destroy the local session token */
"logoutButton" = "Log Out";

// MARK: Deployment verbs
/* Menu item for opening a URL */
"openURL" = "Open URL";

/* Menu item for copying a URL */
"copyURL" = "Copy URL";

/* Menu item for viewing deployment logs */
"viewLogs" = "View Deployment Logs";

/* Menu item for viewing a commit on GitHub */
"viewCommit" = "View Commit";

/* Tooltip for a button to open a deployment URL */
"openDeploymentURL" = "Open Deployment URL";

/* Title for deployments without an associated commit */
"manualDeployment" = "Manual Deployment";

// MARK: Offline states
/* Title for view when network connection is unavailable */
"offlineHeading" = "Network Offline";

/* Description for view when network connection is unavailable, explaining that the app will periodically keep trying to connect */
"offlineDescription" = "Zeitgeist will automatically try again when a network connection is available.";
